# DataFrames

Los DataFrames son el caballo de batalla de Pandas y están directamente inspirados en el lenguaje de programación R. 

** Podemos entender un DataFrame como un conjunto de Series que comparten el mismo índice. **

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

In [3]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [4]:
df #La función randn() devuelve un número de la normal estándar

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Selección e índices

A continuación se presentan varias formas de acceder a los datos de un DataFrame:

In [9]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [ ]:
# SQL Syntax (NO RECOMENDADO!)
# Aunque también podríamos acceder a una columna directamente como df.W, 
# no se recomienda porque podría confundirse con el nombre de un método

df.W

** Las columnas de los DataFrame son simplemetne Series **

In [10]:
type(df['W'])

pandas.core.series.Series

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
# Es posible acceder a varias columnas a la vez pasando una lista de nombres de columnas
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [13]:
df[['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

** Creando una columna nueva:**

In [14]:
df['new'] = df['W'] + df['Y']

In [15]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

** Eliminando columnas**

In [16]:
df.drop('new',axis=1)   # axis=1 indica que queremos eliminar una columna; si fuera 0 sería una fila (por defecto axis es 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
# No modifica el DataFrame a menos que sea especificado!
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [ ]:
df.drop('new',axis=1,inplace=True)

In [18]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

También se pueden eliminar filas, así:

In [19]:
# El parámetro axis por defecto es igual a 0 (fila)

df.drop('E',axis=0)

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [ ]:
# No modifica el objeto porque no se le pasa el parámetro inplace=True
df

** Selección de filas **

In [20]:
# En los dataframes no solo las columnas pueden ser consideradas Series, las filas también.
# Es posible acceder a una fila específica usando la propiedad loc (location)

df.loc['A']

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    3.614819
Name: A, dtype: float64

In [21]:
df.loc['D']

W      0.188695
X     -0.758872
Y     -0.933237
Z      0.955057
new   -0.744542
Name: D, dtype: float64

O puede ser seleccionado mediante la pripiedad iloc (index location):

In [23]:
df.iloc[0] ##Recordemos que arranca en 0

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    3.614819
Name: A, dtype: float64

** Seleccionando un subconjunto de filas y columnas**

In [24]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [26]:
df.loc['B','Y'] #Buscando un valor específico dentro del dataframe

-0.8480769834036315

In [27]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### Selección condicional

Similar a Numpy, en Pandas también se soporta selección condicional usando corchetes cuadrados:

In [28]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [30]:
df>0 #Retorna valores de verdad dado que es una prueba lógica

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True  False
C  False   True   True  False  False
D   True  False  False   True  False
E   True   True   True   True   True

In [31]:
booldf = df > 0

In [32]:
booldf

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True  False
C  False   True   True  False  False
D   True  False  False   True  False
E   True   True   True   True   True

In [34]:
df [booldf] #Trae los valores del Dataframe cuyo valor de verdad es verdadero

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057       NaN
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [36]:
# Directamente
df[df>0] ##Me parece mejor pq es directo

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057       NaN
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [37]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [38]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [40]:
df[df['W']>0] #Quita las filas que no satisfacen la condicion

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [41]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [42]:
df [df['Z']>0.8]

          W         X         Y         Z       new
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [43]:
df [df['W']> 0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [44]:
resultdf = df [df['W']> 0]

In [45]:
resultdf['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [46]:
df[df['W']>0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [47]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [48]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [49]:
# Si hicieramos lo anterior paso a paso:
boolSer = df['W']>0
result = df[boolSer]
myCols = ['Y', 'X']
result[myCols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

### Condiciones múltiples

Para más de un condicional es posible usar los operadores | (o) y & (y) con paréntesis:

In [50]:
df[(df['X']>0) & (df['Y']>0)]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [51]:
df[(df['X']>0) | (df['Y']>0)]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
E  0.190794  1.978757  2.605967  0.683509  2.796762

## Más detalles de los índices

In [52]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [53]:
# El método reset_index reinicia los índices de un DataFrame como número 
# y deja los índices anteriores como una columna adicional

df.reset_index()

  index         W         X         Y         Z       new
0     A  2.706850  0.628133  0.907969  0.503826  3.614819
1     B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
2     C -2.018168  0.740122  0.528813 -0.589001 -1.489355
3     D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
4     E  0.190794  1.978757  2.605967  0.683509  2.796762

In [54]:
# Si queremos que el cambio sea permanente, el parámetro inplace debe ser True 

# df.reset_index(inplace=true)

In [55]:
# Podemos crear una nueva lista, cuyo elementos más adelante usaremos como nuevos índices
newind = 'Colombia Perú Ecuador Venezuela Brasil'.split()

In [56]:
newind

['Colombia', 'Perú', 'Ecuador', 'Venezuela', 'Brasil']

In [57]:
df['País'] = newind

In [58]:
df

          W         X         Y         Z       new       País
A  2.706850  0.628133  0.907969  0.503826  3.614819   Colombia
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959       Perú
C -2.018168  0.740122  0.528813 -0.589001 -1.489355    Ecuador
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542  Venezuela
E  0.190794  1.978757  2.605967  0.683509  2.796762     Brasil

In [59]:
# Se asigna la lista de países como nuevo índice
df.set_index('País')

                  W         X         Y         Z       new
País
Colombia   2.706850  0.628133  0.907969  0.503826  3.614819
Perú       0.651118 -0.319318 -0.848077  0.605965 -0.196959
Ecuador   -2.018168  0.740122  0.528813 -0.589001 -1.489355
Venezuela  0.188695 -0.758872 -0.933237  0.955057 -0.744542
Brasil     0.190794  1.978757  2.605967  0.683509  2.796762

In [60]:
df

          W         X         Y         Z       new       País
A  2.706850  0.628133  0.907969  0.503826  3.614819   Colombia
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959       Perú
C -2.018168  0.740122  0.528813 -0.589001 -1.489355    Ecuador
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542  Venezuela
E  0.190794  1.978757  2.605967  0.683509  2.796762     Brasil

In [66]:
# Si queremos que el cambio sea permanente, inplace=True
df.set_index('País',inplace=True) ##Se actualiza el dataframe, no se debe reasignar

In [67]:
df

                  W         X         Y         Z       new
País
Colombia   2.706850  0.628133  0.907969  0.503826  3.614819
Perú       0.651118 -0.319318 -0.848077  0.605965 -0.196959
Ecuador   -2.018168  0.740122  0.528813 -0.589001 -1.489355
Venezuela  0.188695 -0.758872 -0.933237  0.955057 -0.744542
Brasil     0.190794  1.978757  2.605967  0.683509  2.796762

## Multi-índices y jerarquía de índices

In [68]:
# Niveles de índices
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [69]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [70]:
# Multi-índice
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [71]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [72]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.147027 -0.479448
   2  0.558769  1.024810
   3 -0.925874  1.862864
G2 1 -1.133817  0.610478
   2  0.386030  2.084019
   3 -0.376519  0.230336

Ahora vamos a mostrar cómo indexar esto! 
Para la jerarquía de índice en las filas usamos df.loc[]. 
Si la jerarquía de índices estuviera en el eje de columnas, solo sería necesaria la notación de corchete normal df[]. 

Llamar a un nivel del índice devuelve el sub-DataFrame de datos:

In [73]:
df.loc['G1']

          A         B
1  0.147027 -0.479448
2  0.558769  1.024810
3 -0.925874  1.862864

In [74]:
df.loc['G1'].loc[1]

A    0.147027
B   -0.479448
Name: 1, dtype: float64

In [75]:
df.index.names

FrozenList([None, None])

In [76]:
df.index.names = ['Grupo','Num']

In [77]:
df

                  A         B
Grupo Num
G1    1    0.147027 -0.479448
      2    0.558769  1.024810
      3   -0.925874  1.862864
G2    1   -1.133817  0.610478
      2    0.386030  2.084019
      3   -0.376519  0.230336

In [78]:
# Para seleccionar un dato específico 
df.loc['G2'].loc[3]['B']

0.23033634359240704

### Cross-Section

La función **xs** retorna la sección transversal de un DataFrame que usa multi-índices.

Por ejemplo, es útil cuando queremos filtrar todos los elementos de un determinado "Num" en el DataFrame anterior, independientemente de su Grupo.

In [79]:
# En este caso seleccionamos el Num=1
df.xs(1,level='Num')

              A         B
Grupo
G1     0.147027 -0.479448
G2    -1.133817  0.610478

In [80]:
df.loc['G1']

            A         B
Num
1    0.147027 -0.479448
2    0.558769  1.024810
3   -0.925874  1.862864

In [81]:
# También, se puede hacer lo siguiente (sin usar loc):
df.xs('G1')

            A         B
Num
1    0.147027 -0.479448
2    0.558769  1.024810
3   -0.925874  1.862864

In [82]:
df.xs(['G1',1])

A    0.147027
B   -0.479448
Name: (G1, 1), dtype: float64

In [83]:
# Para lo anterior, usando loc hubieramos tenido que hacer lo siguiente:
df.loc['G1'].loc[1]

A    0.147027
B   -0.479448
Name: 1, dtype: float64